results/runs/ycsb/2026-05-10T13-11-53/redis/load_workload_a.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
Command line: -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-05-10 13:05:10:331 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-10 13:05:20:196 10 sec: 59513 operations; 5950.7 current ops/sec; est completion in 7 second [INSERT: Count=59528, Max=49055, Min=158, Avg=1615.33, 90=3095, 99=8887, 99.9=18639, 99.99=45823] 
2026-05-10 13:05:25:851 15 sec: 100000 operations; 7160.77 current ops/sec; [CLEANUP: Count=10, Max=1807, Min=68, Avg=342.4, 90=368, 99=1807, 99.9=1807, 99.99=1807] [INSERT: Count=40472, Max=22095, Min=150, Avg=1381.51, 90=2155, 99=6143, 99.9=11135, 99.99=16463] 
[OVERALL], RunTime(ms), 15656
[OVERALL], Throughput(ops/sec), 6387.327542156362
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 125
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7984159427695453
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 125
[TOTAL_GC_TIME_%], Time(%), 0.7984159427695453
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 342.4
[CLEANUP], MinLatency(us), 68
[CLEANUP], MaxLatency(us), 1807
[CLEANUP], 95thPercentileLatency(us), 1807
[CLEANUP], 99thPercentileLatency(us), 1807
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 1520.69583
[INSERT], MinLatency(us), 150
[INSERT], MaxLatency(us), 49055
[INSERT], 95thPercentileLatency(us), 4147
[INSERT], 99thPercentileLatency(us), 7847
[INSERT], Return=OK, 100000